Ran Plan for 2 projects:

1. project: `production` dir: `deployment/prod/terraform` workspace: `default`
1. project: `development` dir: `deployment/dev/terraform` workspace: `default`

### 1. project: `production` dir: `deployment/prod/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.google_client_config.current: Reading...
data.google_client_config.current: Read complete after 0s [id=projects/"bits-backstage-prod"/regions/"us-east4"/zones/<null>]
data.google_project.current: Reading...
data.google_project.current: Read complete after 1s [id=projects/bits-backstage-prod]
module.postgres.data.google_compute_zones.available[0]: Reading...
module.postgres.data.google_compute_zones.available[0]: Read complete after 0s [id=projects/bits-backstage-prod/regions/us-east4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_project_iam_member.sa_access will be created
+ resource "google_project_iam_member" "sa_access" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "group:devnull-sa@broadinstitute.org"
+       project = "bits-backstage-prod"
+       role    = "roles/owner"
    }

  # google_project_iam_member.team_access will be created
+ resource "google_project_iam_member" "team_access" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "group:devnull@broadinstitute.org"
+       project = "bits-backstage-prod"
+       role    = "roles/editor"
    }

  # google_secret_manager_secret.backstage-bits-credentials["auth-github-client-id"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-github-client-id"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["auth-github-client-secret"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-github-client-secret"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["auth-google-client-id"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-google-client-id"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["auth-google-client-secret"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "auth-google-client-secret"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "google"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "string"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_secret_manager_secret.backstage-bits-credentials["github-app-backstage-bits-credentials"] will be created
+ resource "google_secret_manager_secret" "backstage-bits-credentials" {
+       create_time           = (known after apply)
+       effective_annotations = (known after apply)
+       effective_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "yaml-file"
        }
+       expire_time           = (known after apply)
+       id                    = (known after apply)
+       labels                = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "yaml-file"
        }
+       name                  = (known after apply)
+       project               = "bits-backstage-prod"
+       secret_id             = "github-app-backstage-bits-credentials"
+       terraform_labels      = {
+           "created-by"       = "terraform"
+           "service"          = "github"
+           "terraform-module" = "terraform-bits-backstage-prod"
+           "type"             = "yaml-file"
        }

+       replication {
+           auto {
            }
        }
    }

  # google_service_account_iam_member.db_workload_identity will be created
+ resource "google_service_account_iam_member" "db_workload_identity" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "serviceAccount:bits-gke-clusters.svc.id.goog[backstage/backstage]"
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = (known after apply)
    }

  # google_storage_bucket.tech-docs will be created
+ resource "google_storage_bucket" "tech-docs" {
+       effective_labels            = (known after apply)
+       force_destroy               = false
+       id                          = (known after apply)
+       location                    = "US"
+       name                        = "bits-backstage-prod-techdocs"
+       project                     = "bits-backstage-prod"
+       public_access_prevention    = (known after apply)
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = (known after apply)
+       uniform_bucket_level_access = true
+       url                         = (known after apply)

+       lifecycle_rule {
+           action {
+               type = "Delete"
            }
+           condition {
+               age                   = 365
+               matches_prefix        = []
+               matches_storage_class = []
+               matches_suffix        = []
+               num_newer_versions    = 1
+               with_state            = (known after apply)
            }
        }

+       versioning {
+           enabled = true
        }
    }

  # google_storage_bucket_iam_member.service-account will be created
+ resource "google_storage_bucket_iam_member" "service-account" {
+       bucket = "bits-backstage-prod-techdocs"
+       etag   = (known after apply)
+       id     = (known after apply)
+       member = (known after apply)
+       role   = "roles/storage.admin"
    }

  # postgresql_grant.database_connect["backstage"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_app"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_app"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_auth"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_auth"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_catalog"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_catalog"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_scaffolder"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_scaffolder"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.database_connect["backstage_plugin_search"] will be created
+ resource "postgresql_grant" "database_connect" {
+       database          = "backstage_plugin_search"
+       id                = (known after apply)
+       object_type       = "database"
+       privileges        = [
+           "CONNECT",
+           "CREATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_app"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_app"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_auth"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_auth"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_catalog"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_catalog"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_scaffolder"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_scaffolder"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.schema_usage_create["backstage_plugin_search"] will be created
+ resource "postgresql_grant" "schema_usage_create" {
+       database          = "backstage_plugin_search"
+       id                = (known after apply)
+       object_type       = "schema"
+       privileges        = [
+           "CREATE",
+           "USAGE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_app"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_app"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_auth"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_auth"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_catalog"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_catalog"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_scaffolder"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_scaffolder"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # postgresql_grant.table_permissions["backstage_plugin_search"] will be created
+ resource "postgresql_grant" "table_permissions" {
+       database          = "backstage_plugin_search"
+       id                = (known after apply)
+       object_type       = "table"
+       privileges        = [
+           "DELETE",
+           "INSERT",
+           "SELECT",
+           "UPDATE",
        ]
+       role              = (known after apply)
+       schema            = "public"
+       with_grant_option = false
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/cloudsql.client"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/cloudsql.client"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/cloudsql.instanceUser"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/cloudsql.instanceUser"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/iam.serviceAccountTokenCreator"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/monitoring.metricWriter"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/monitoring.metricWriter"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/monitoring.viewer"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/monitoring.viewer"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-prod=>roles/secretmanager.secretAccessor"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-backstage-prod"
+       role    = "roles/secretmanager.secretAccessor"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters-dev=>roles/container.clusterViewer"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-gke-clusters-dev"
+       role    = "roles/container.clusterViewer"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters-dev=>roles/container.viewer"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-gke-clusters-dev"
+       role    = "roles/container.viewer"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters=>roles/container.clusterViewer"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-gke-clusters"
+       role    = "roles/container.clusterViewer"
    }

  # module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters=>roles/container.viewer"] will be created
+ resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "bits-gke-clusters"
+       role    = "roles/container.viewer"
    }

  # module.db_service_accounts.google_service_account.service_accounts["backstage"] will be created
+ resource "google_service_account" "service_accounts" {
+       account_id   = "backstage"
+       description  = "service account for backstage"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       member       = (known after apply)
+       name         = (known after apply)
+       project      = "bits-backstage-prod"
+       unique_id    = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_app"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_app"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_auth"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_auth"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_catalog"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_catalog"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_scaffolder"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_scaffolder"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.additional_databases["backstage_plugin_search"] will be created
+ resource "google_sql_database" "additional_databases" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage_plugin_search"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database.default[0] will be created
+ resource "google_sql_database" "default" {
+       collation       = (known after apply)
+       deletion_policy = "DELETE"
+       id              = (known after apply)
+       instance        = "backstage-prod"
+       name            = "backstage"
+       project         = "bits-backstage-prod"
+       self_link       = (known after apply)
    }

  # module.postgres.google_sql_database_instance.default will be created
+ resource "google_sql_database_instance" "default" {
+       available_maintenance_versions = (known after apply)
+       connection_name                = (known after apply)
+       database_version               = "POSTGRES_15"
+       deletion_protection            = false
+       dns_name                       = (known after apply)
+       encryption_key_name            = (known after apply)
+       first_ip_address               = (known after apply)
+       id                             = (known after apply)
+       instance_type                  = (known after apply)
+       ip_address                     = (known after apply)
+       maintenance_version            = (known after apply)
+       master_instance_name           = (known after apply)
+       name                           = "backstage-prod"
+       private_ip_address             = (known after apply)
+       project                        = "bits-backstage-prod"
+       psc_service_attachment_link    = (known after apply)
+       public_ip_address              = (known after apply)
+       region                         = "us-east4"
+       self_link                      = (known after apply)
+       server_ca_cert                 = (sensitive value)
+       service_account_email_address  = (known after apply)

+       settings {
+           activation_policy           = "ALWAYS"
+           availability_type           = "ZONAL"
+           connector_enforcement       = "NOT_REQUIRED"
+           deletion_protection_enabled = false
+           disk_autoresize             = true
+           disk_autoresize_limit       = 0
+           disk_size                   = 10
+           disk_type                   = "PD_SSD"
+           edition                     = "ENTERPRISE"
+           pricing_plan                = "PER_USE"
+           tier                        = "db-custom-8-32768"
+           user_labels                 = (known after apply)
+           version                     = (known after apply)

+           backup_configuration {
+               enabled                        = false
+               point_in_time_recovery_enabled = false
+               start_time                     = (known after apply)
+               transaction_log_retention_days = (known after apply)
            }

+           database_flags {
+               name  = "cloudsql.iam_authentication"
+               value = "on"
            }

+           ip_configuration {
+               enable_private_path_for_google_cloud_services = false
+               ipv4_enabled                                  = true
+               require_ssl                                   = true
+               ssl_mode                                      = (known after apply)
            }

+           maintenance_window {
+               day          = 1
+               hour         = 23
+               update_track = "canary"
            }
        }

+       timeouts {
+           create = "30m"
+           delete = "30m"
+           update = "30m"
        }
    }

  # module.postgres.google_sql_user.default[0] will be created
+ resource "google_sql_user" "default" {
+       host                    = (known after apply)
+       id                      = (known after apply)
+       instance                = "backstage-prod"
+       name                    = "backstage"
+       password                = (sensitive value)
+       project                 = "bits-backstage-prod"
+       sql_server_user_details = (known after apply)
    }

  # module.postgres.google_sql_user.iam_account["backstage"] will be created
+ resource "google_sql_user" "iam_account" {
+       host                    = (known after apply)
+       id                      = (known after apply)
+       instance                = "backstage-prod"
+       name                    = (known after apply)
+       project                 = "bits-backstage-prod"
+       sql_server_user_details = (known after apply)
+       type                    = (known after apply)
    }

  # module.postgres.null_resource.module_depends_on will be created
+ resource "null_resource" "module_depends_on" {
+       id       = (known after apply)
+       triggers = {
+           "value" = "0"
        }
    }

  # module.postgres.random_password.user-password will be created
+ resource "random_password" "user-password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       keepers     = {
+           "name" = "backstage-prod"
        }
+       length      = 32
+       lower       = true
+       min_lower   = 1
+       min_numeric = 1
+       min_special = 0
+       min_upper   = 1
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = false
+       upper       = true
    }

Plan: 50 to add, 0 to change, 0 to destroy.
```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>
Plan: 50 to add, 0 to change, 0 to destroy.

---
### 2. project: `development` dir: `deployment/dev/terraform` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis/bin/terraform1.7.0 plan -input=false -refresh -out \"/atlantis/repos/broadinstitute/backstage/1/default/deployment/dev/terraform/development-default.tfplan\"" in "/atlantis/repos/broadinstitute/backstage/1/default/deployment/dev/terraform": exit status 1
module.postgres.null_resource.module_depends_on: Refreshing state... [id=6215754838028235222]
google_secret_manager_secret.backstage-bits-credentials["auth-github-client-id"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-github-client-id]
data.google_client_config.current: Reading...
module.db_service_accounts.google_service_account.service_accounts["backstage"]: Refreshing state... [id=projects/bits-backstage-dev/serviceAccounts/backstage@bits-backstage-dev.iam.gserviceaccount.com]
google_secret_manager_secret.backstage-bits-credentials["auth-google-client-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-google-client-secret]
google_secret_manager_secret.backstage-bits-credentials["auth-github-client-secret"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-github-client-secret]
data.google_client_config.current: Read complete after 0s [id=projects/"bits-backstage-dev"/regions/"us-east4"/zones/<null>]
google_secret_manager_secret.backstage-bits-credentials["auth-google-client-id"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/auth-google-client-id]
google_secret_manager_secret.backstage-bits-credentials["github-app-backstage-bits-credentials"]: Refreshing state... [id=projects/bits-backstage-dev/secrets/github-app-backstage-bits-credentials]
google_project_iam_member.team_access: Refreshing state... [id=bits-backstage-dev/roles/editor/group:devnull@broadinstitute.org]
google_storage_bucket.tech-docs: Refreshing state... [id=bits-backstage-dev-tech-docs]
google_project_iam_member.sa_access: Refreshing state... [id=bits-backstage-dev/roles/owner/group:devnull-sa@broadinstitute.org]
data.google_project.current: Reading...
google_project_service.api_services["monitoring.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/monitoring.googleapis.com]
google_project_service.api_services["iap.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/iap.googleapis.com]
google_project_service.api_services["compute.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/compute.googleapis.com]
google_project_service.api_services["cloudidentity.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/cloudidentity.googleapis.com]
google_project_service.api_services["sqladmin.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/sqladmin.googleapis.com]
google_project_service.api_services["sts.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/sts.googleapis.com]
google_project_service.api_services["iam.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/iam.googleapis.com]
google_project_service.api_services["secretmanager.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/secretmanager.googleapis.com]
data.google_project.current: Read complete after 1s [id=projects/bits-backstage-dev]
google_project_service.api_services["iamcredentials.googleapis.com"]: Refreshing state... [id=bits-backstage-dev/iamcredentials.googleapis.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters=>roles/container.clusterViewer"]: Refreshing state... [id=bits-gke-clusters/roles/container.clusterViewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=bits-backstage-dev/roles/iam.serviceAccountTokenCreator/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/cloudsql.instanceUser"]: Refreshing state... [id=bits-backstage-dev/roles/cloudsql.instanceUser/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters-dev=>roles/container.clusterViewer"]: Refreshing state... [id=bits-gke-clusters-dev/roles/container.clusterViewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/monitoring.metricWriter"]: Refreshing state... [id=bits-backstage-dev/roles/monitoring.metricWriter/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters-dev=>roles/container.viewer"]: Refreshing state... [id=bits-gke-clusters-dev/roles/container.viewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-gke-clusters=>roles/container.viewer"]: Refreshing state... [id=bits-gke-clusters/roles/container.viewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/secretmanager.secretAccessor"]: Refreshing state... [id=bits-backstage-dev/roles/secretmanager.secretAccessor/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/cloudsql.client"]: Refreshing state... [id=bits-backstage-dev/roles/cloudsql.client/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.db_service_accounts.google_project_iam_member.project-roles["backstage-bits-backstage-dev=>roles/monitoring.viewer"]: Refreshing state... [id=bits-backstage-dev/roles/monitoring.viewer/serviceAccount:backstage@bits-backstage-dev.iam.gserviceaccount.com]
module.postgres.google_sql_database_instance.default: Refreshing state... [id=backstage-dev]
module.postgres.data.google_compute_zones.available[0]: Reading...
module.postgres.data.google_compute_zones.available[0]: Read complete after 0s [id=projects/bits-backstage-dev/regions/us-east4]
google_service_account_iam_member.db_workload_identity: Refreshing state... [id=projects/bits-backstage-dev/serviceAccounts/backstage@bits-backstage-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:bits-gke-clusters-dev.svc.id.goog[backstage/backstage]]
module.postgres.google_sql_database.additional_databases["backstage_plugin_app"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_app]
module.postgres.google_sql_database.additional_databases["backstage_plugin_scaffolder"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_scaffolder]
module.postgres.google_sql_database.additional_databases["backstage_plugin_search"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_search]
module.postgres.google_sql_database.default[0]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage]
module.postgres.google_sql_user.iam_account["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam//backstage-dev]
module.postgres.google_sql_database.additional_databases["backstage_plugin_catalog"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_catalog]
module.postgres.random_password.user-password: Refreshing state... [id=none]
module.postgres.google_sql_database.additional_databases["backstage_plugin_auth"]: Refreshing state... [id=projects/bits-backstage-dev/instances/backstage-dev/databases/backstage_plugin_auth]
module.postgres.google_sql_user.default[0]: Refreshing state... [id=backstage//backstage-dev]
postgresql_grant.schema_usage_create["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_auth"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_auth_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_catalog"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_catalog_public_schema]
postgresql_grant.schema_usage_create["backstage_plugin_search"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_search_public_schema]
postgresql_grant.table_permissions["backstage_plugin_search"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_search_public_table]
postgresql_grant.schema_usage_create["backstage_plugin_app"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_app_public_schema]
postgresql_grant.table_permissions["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_public_table]
postgresql_grant.table_permissions["backstage_plugin_catalog"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_catalog_public_table]
postgresql_grant.schema_usage_create["backstage_plugin_scaffolder"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_scaffolder_public_schema]
postgresql_grant.table_permissions["backstage_plugin_scaffolder"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_scaffolder_public_table]
postgresql_grant.table_permissions["backstage_plugin_app"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_app_public_table]
postgresql_grant.table_permissions["backstage_plugin_auth"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_auth_public_table]
postgresql_grant.database_connect["backstage_plugin_catalog"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_catalog_database]
postgresql_grant.database_connect["backstage_plugin_scaffolder"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_scaffolder_database]
postgresql_grant.database_connect["backstage_plugin_search"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_search_database]
postgresql_grant.database_connect["backstage"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_database]
postgresql_grant.database_connect["backstage_plugin_auth"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_auth_database]
postgresql_grant.database_connect["backstage_plugin_app"]: Refreshing state... [id=backstage@bits-backstage-dev.iam_backstage_plugin_app_database]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # google_storage_bucket.tech-docs must be replaced
-/+ resource "google_storage_bucket" "tech-docs" {
      - default_event_based_hold    = false -> null
      ~ effective_labels            = {} -> (known after apply)
      - enable_object_retention     = false -> null
      ~ id                          = "bits-backstage-dev-tech-docs" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "bits-backstage-dev-tech-docs" -> "bits-backstage-dev-techdocs" # forces replacement
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      ~ rpo                         = "DEFAULT" -> (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/bits-backstage-dev-tech-docs" -> (known after apply)
      ~ terraform_labels            = {} -> (known after apply)
      ~ url                         = "gs://bits-backstage-dev-tech-docs" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ lifecycle_rule {
          - condition {
              - age                        = 365 -> null
              - days_since_custom_time     = 0 -> null
              - days_since_noncurrent_time = 0 -> null
              - matches_prefix             = [] -> null
              - matches_storage_class      = [] -> null
              - matches_suffix             = [] -> null
              - no_age                     = false -> null
              - num_newer_versions         = 1 -> null
              - with_state                 = "ANY" -> null
            }
          + condition {
              + age                   = 365
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + num_newer_versions    = 1
              + with_state            = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Error: Instance cannot be destroyed
│ 
│   on main.tf line 38:
│   38: resource "google_storage_bucket" "tech-docs" {
│ 
│ Resource google_storage_bucket.tech-docs has lifecycle.prevent_destroy set,
│ but the plan calls for this resource to be destroyed. To avoid this error
│ and continue with the plan, either disable lifecycle.prevent_destroy or
│ reduce the scope of the plan using the -target option.
╵


```
</details>

---